Revit 2024 API
ReleaseConditions Members
The ReleaseConditions type exposes the following members.
Constructors
Name | Description
ReleaseConditions(Boolean)
 Creates a new instance of ReleaseConditions.
ReleaseConditions(Boolean, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
 Creates a new instance of ReleaseConditions.
Methods
Name | Description
Dispose
Releases all resources used by the ReleaseConditions
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Fx
 Gets or Sets the Fx of the release type.
Fy
 Gets or Sets the Fy of the release type.
Fz
 Gets or Sets the Fz of the release type.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Mx
 Gets or Sets the Mx of the release type.
My
 Gets or Sets the My of the release type.
Mz
 Gets or Sets the Mz of the release type.
Start
 Gets or Sets the position of release type. True for start, false for end.
See Also
ReleaseConditions Class
Autodesk.Revit.DB.Structure Namespace